s = '''

五行属水的字：1993个

2画 五行属水的字是： 八 勹 卜 乜

3画 五行属水的字是： 凡 飞 马 么 门 万 亡 习 下 乡 子

4画 五行属水的字是： 巴 办 贝 比 币 不 歹 反 方 分 风 凤 夫 父 讣
冈 互 戶 户 化 幻 计 毛 爿 匹 片 攴 仆 壬 卅 水 文 无 毋 勿 凶 云

5画 五行属水的字是： 扒 叭 白 半 包 北 必 边 弁 卟 布 匆 发 犯 氾
冯 弗 付 邗 汉 夯 号 禾 弘 乎 汇 劢 邙 矛 们 灭 民 皿 末 母 目 仫
丕 皮 氕 平 叵 扑 讫 仨 疋 汀 务 写 兄 玄 穴 训 印 匝 汁

6画 五行属水的字是： 百 阪 邦 毕 闭 邠 冰 并 汊 池 闯 凼 讹 伐 帆
汎 邡 防 仿 访 妃 份 讽 缶 伏 凫 负 妇 亥 汗 行 好 合 红 后 冱 华
欢 回 会 讳 汲 江 邟 妈 犸 吗 买 迈 忙 扪 米 糸 名 牟 仳 牝 乒 迄
汔 汝 杀 汕 收 汜 汤 网 危 污 汐 向 协 邪 刑 兴 休 血 汛 杂

7画 五行属水的字是： 夿 把 弝 吧 扳 伴 扮 报 陂 孛 邶 貝 狈 呗 伻
皀 吡 佊 沘 妣 庇 邲 诐 抃 汳 汴 忭 别 兵 邴 伯 驳 补 步 吥 沧 沉
呆 沌 返 饭 泛 妨 纺 吠 吩 纷 汾 沣 沨 佛 否 呋 扶 孚 抚 甫 汞 佝
沟 汩 还 邯 含 罕 沆 诃 亨 宏 囫 护 沪 怀 奂 即 戒 鸠 况 泐 冷 沥
沦 玛 祃 麦 尨 沒 没 每 闷 芈 汨 沔 妙 闵 亩 沐 尿 妞 扭 狃 忸 纽
沤 彷 抛 沛 批 邳 伾 屁 评 沏 汽 沁 扰 沙 纱 沈 汰 汪 忘 沩 尾 纹
汶 沃 希 闲 孝 忻 形 汹 妍 沂 妤 沅 沄 妘 沚 状

8画 五行属水的字是： 岸 拔 爸 败 攽 版 拌 姅 绊 孢 饱 抱 卑 备 奔
屄 彼 畀 贬 变 表 玢 秉 幷 並 拨 波 帛 瓝 泊 怖 法 范 贩 祊 肪 房
放 非 肥 肺 狒 沸 氛 奋 忿 奉 肤 拂 服 怫 绂 绋 拊 府 咐 阜 驸 侅
泔 岡 沽 卦 函 呵 和 劾 河 佫 轰 泓 郈 呼 狐 弧 虎 怙 诨 或 货 泾
沮 炬 泪 泠 泷 泸 泺 码 卖 盲 氓 牦 泖 玫 妹 門 孟 弥 觅 泌 宓 黾
苗 庙 玟 抿 泯 鸣 命 抹 殁 沫 陌 侔 拇 姆 牧 泥 泞 拍 泮 咆 狍 庖
泡 呸 帔 佩 抨 怦 朋 披 拚 贫 郱 泼 迫 泣 浅 泅 沭 饲 泗 沲 沱 味
武 物 郃 弦 冼 现 享 協 胁 泄 泻 绁 幸 泫 学 郇 沿 泱 泳 油 鱼 雨
郁 咂 泽 沾 沼 治 注 狀

9画 五行属水的字是： 疤 胈 拜 帮 绑 胞 保 鸨 背 贲 甭 泵 迸 秕 珌
毖 哔 陛 窆 扁 昪 便 飑 骉 饼 玻 勃 钚 测 浐 泚 荡 点 洞 洱 畈 飛
封 風 疯 罘 氟 俘 郛 祓 复 負 訃 阁 哈 孩 骇 顸 绗 阂 贺 很 狠 恨
恒 洪 紅 侯 厚 轷 浒 祜 哗 骅 徊 洹 奐 宦 皇 挥 虺 洄 哕 浍 诲 绘
浑 活 計 洎 济 挟 浃 茳 洚 浇 洁 津 荆 姥 洌 浏 洛 蚂 骂 脉 茫 昴
冒 贸 眉 美 昧 虻 咪 迷 祢 洣 弭 眄 勉 眇 秒 咩 珉 闽 哞 某 浓 哌
派 眅 盼 叛 胖 胚 毗 骈 拼 姘 品 俜 玶 洴 屏 珀 匍 柒 洽 泉 染 娆
洳 洒 飒 洮 洼 洧 闻 郚 郗 洗 虾 咸 涎 宪 香 响 饷 项 巷 卸 洩 洫
恤 泶 洵 浔 恂 徇 衍 洋 洇 荥 盈 拶 浈 洲 洙 浊

10画 五行属水的字是：氨 捌 粑 罢 班 般 颁 舨 浜 蚌 趵 豹 倍 狽 悖
被 唄 倴 畚 俾 舭 粃 毙 畢 狴 髟 俵 宾 病 砵 饽 袯 亳 浡 逋 庯 捕
哺 部 涔 秤 臭 唇 涤 娥 舫 紡 匪 诽 紛 峰 逢 俸 蚨 浮 俯 釜 胲 海
氦 害 浛 航 颃 蚝 耗 浩 盍 哼 珩 竑 候 華 换 唤 涣 浣 珲 晖 悔 恚
贿 浹 贾 涧 浆 较 浸 涇 酒 涓 浚 涞 浪 涝 涟 流 馬 唛 脈 旄 浼 們
勐 脒 敉 秘 眠 悯 冥 莫 秣 毪 畝 涅 紐 俳 畔 袢 旁 袍 疱 陪 配 旆
倗 蚍 郫 疲 陴 胼 娉 瓶 哱 圃 浦 凄 訖 润 脎 涩 殺 紗 涉 涑 绥 娑
泰 烫 涛 涕 涂 涒 涠 蚊 紋 涡 浯 務 浠 消 效 挾 脅 屑 訓 珢 涌 浴
耘 涨 浙 浞
11画 五行属水的字是：豝 敗 湴 絆 偝 绷 偪 閉 庳 敝 婢 匾 貶 彪 婊
菠 舶 脖 啵 脣 淳 淙 淬 淡 淀 渎 訛 販 訪 婓 啡 绯 淝 悱 酚 偾 唪
麸 趺 匐 涪 艴 紱 紼 辅 婦 袱 淦 髙 够 涫 蚶 琀 涵 毫 淏 菏 盒 涸
痕 鸿 唿 惚 唬 瓠 扈 淮 患 逭 凰 彗 晦 阍 婚 馄 混 貨 祸 渐 蚵 淶
淚 涼 猎 淋 淩 渌 淪 麻 麥 曼 猫 袤 捫 猛 眯 猕 谜 覓 密 绵 冕 渑
喵 描 敏 眸 谋 淖 脲 排 徘 盘 脬 匏 烹 捧 啤 偏 谝 殍 票 貧 萍 颇
婆 粕 脯 淇 淺 清 渠 渃 深 渖 渗 淑 涮 淞 挲 淌 淘 添 淟 晚 涴 望
逶 偎 隈 阌 渦 淅 現 鄉 淆 涬 婞 訩 虚 雪 涯 淹 液 淫 渶 淤 雩 魚
渔 鄅 淯 渊 渚 涿 淄 渍

12画 五行属水的字是：鲃 跋 斑 綁 棓 傍 谤 報 悲 琲 辈 備 惫 賁 絣
琫 逼 皕 赑 詖 愊 愎 弼 编 惼 揙 徧 遍 缏 猋 傧 斌 摒 博 葧 鹁 渤
跛 補 鈈 瓿 測 滁 湻 渡 發 番 飯 鲂 扉 腓 斐 粪 愤 馮 渢 跗 稃 幅
腑 赋 傅 富 溉 港 缑 蛤 酣 韩 寒 喊 絎 喝 訶 颌 訸 軤 猢 湖 琥 猾
滑 換 喚 痪 渙 遑 徨 湟 惶 揮 辉 蛔 惠 喙 缋 渾 耠 惑 禍 湔 溅 渴
溃 阔 落 傌 買 蛮 鄚 帽 貿 猸 湄 媒 渼 寐 媚 悶 幂 谧 湎 缅 淼 渺
缈 缗 閔 湣 黽 鄍 谟 蛑 湳 琶 牌 蒎 湃 跑 赔 喷 湓 彭 琵 脾 痞 骗
評 普 湫 惹 湿 溲 湯 湉 琠 湍 湾 萬 溈 湋 渭 雯 渥 無 喜 隙 閑 湘
飨 項 亵 渫 雄 溆 渲 湮 欹 絏 颍 湧 游 渝 淵 雲 渣 湛 湞 滞 粥 煮
滋
13画 五行属水的字是：靶 鲅 搬 頒 斒 稖 龅 雹 飽 鲍 鹎 傰 鄙 閟 跸
嗶 腷 痹 滗 裨 裱 滨 缤 摈 禀 搏 鲌 馎 滄 滀 鹑 滌 滇 蜂 缝 鳧 福
滏 腹 鲋 缚 滚 傼 颔 頏 嗥 號 滈 阖 嗨 瑚 鄠 嘩 豢 滉 暉 毁 匯 賄
會 琿 魂 溷 賈 較 粳 鳩 溘 滥 蒗 雷 漓 溧 漣 粱 溜 滦 媽 嗎 獁 满
鄤 谩 漭 瑁 蒙 盟 腼 鹋 瞄 愍 溟 酩 摸 馍 嫫 貊 貉 漠 寞 溺 滂 辔
搒 鹏 睥 辟 媲 犏 剽 频 嫔 聘 鲆 溥 溱 裘 溶 溽 滠 飼 溯 綏 溻 滩
溏 滔 微 溦 雾 溪 携 溴 滟 溢 滢 源 滓

14画 五行属水的字是：魃 蝂 蜯 褓 骳 褙 嘣 綳 鼻 碧 馝 弊 幣 稨 褊
摽 幖 颮 滮 骠 賓 殡 膑 餅 駁 僰 箔 膊 漕 滻 漘 滴 蜚 緋 翡 僨 瘋
鳳 孵 輔 腐 赙 複 澉 閣 嘏 寡 滾 撖 漢 豪 閡 褐 滹 鹕 滸 滬 瘓 漶
潢 誨 霁 漸 漤 潋 漏 漉 漯 瑪 嘛 勱 嘜 馒 滿 幔 漫 慢 缦 髦 貌 瞀
麽 麼 酶 鹛 魅 蜢 艋 嘧 蜜 綿 閩 暝 鳴 摹 膜 慕 暮 漚 膀 蜱 罴 漂
缥 嫖 嘌 撇 鄱 魄 頗 僕 谱 漆 蜞 颯 滲 漱 霆 網 潍 瘟 聞 舞 熙 餉
鲞 潇 熊 漩 踅 熏 窨 鲟 演 漾 漪 滎 潆 漁 漳 漲 潴 漬

15画 五行属水的字是：澳 罷 瘢 魬 褒 鴇 緥 暴 輩 髲 駜 潷 蝙 編 緶
膘 麃 憋 瘪 播 撥 餑 踣 餔 潺 潮 澈 澂 澄 蝽 醇 蕩 幡 範 魴 誹 憤
麩 膚 蝠 幞 撫 駙 賦 蝮 蝜 緱 虢 骸 憨 頜 鹤 踝 鲩 璜 輝 麾 慧 澗
漿 澆 潔 潰 澜 澇 犛 潦 凛 履 碼 罵 賣 邁 瞒 蝥 霉 緬 緲 廟 緡 憫
瞑 摩 墨 瘼 潘 醅 賠 霈 噴 嘭 澎 翩 潑 撲 噗 潜 潛 嬈 潤 撒 鲨 潸
澐 震 潲 澠 澍 澌 潭 漽 潼 潿 嬉 霄 勰 缬 寫 潯 潁

16画 五行属水的字是：辦 薄 虣 鮑 憊 糒 甏 觱 鮅 避 嬖 辨 辩 飙 飚
瘭 褾 儐 濒 馞 鮊 澶 醕 澹 澱 璠 霏 鲱 奮 縫 諷 縛 鲴 盥 還 駭 撼
翰 頷 澣 憾 翮 醐 寰 缳 擐 噦 諱 澮 閽 餛 諢 霍 濑 澧 濂 霖 潞 螞
颟 鞔 瞞 螨 蟒 醚 謎 螟 默 謀 霓 凝 濃 螃 耪 膨 駢 蹁 諞 瓢 瞟 瞥
頻 鮃 璞 氆 憩 霎 潚 濉 燙 靦 閿 禧 憲 獬 邂 廨 懈 興 噱 學 澡 澤
濁

17画 五行属水的字是：癍 幫 謗 鲾 鞞 蹕 髀 斃 濞 臂 鳊 辫 豳 濱 擯
襏 擘 點 繁 鼢 鲼 糞 黻 襆 黼 鳆 醢 鼾 韓 嚎 濠 鴻 觳 隳 濟 瀞 闊
濫 蟎 縵 蟊 懑 朦 糜 彌 謐 邈 嬤 貘 嬷 濘 蹒 貔 螵 縹 嬪 皤 濮 濡
澀 濕 霜 穗 濤 濰 霞 澩 獯 濯

18画 五行属水的字是：鼥 奰 鞭 邊 瀌 蹩 殯 臏 鵓 餺 鵏 瀍 闖 瀆 藩
翻 覆 馥 鹱 鯇 蟪 繢 瀐 濺 獵 瀏 濼 謾 懵 禰 饃 蹣 蟠 蟛 癖 鯆 瀑
鳍 擾 瀋 霧 瀉 瀅 雜

19画 五行属水的字是：瓣 鵯 鞴 襣 襞 臕 鳔 鳖 癟 瀕 髌 醭 簿 鶉 蹯
鯡 羹 鞲 韝 鯝 瀚 懷 繯 繪 嚯 瀖 瀨 瀝 瀘 饅 鳗 艨 蠓 靡 鶓 鳘 髈
鵬 羆 騙 蹼 譜 瀜 瀟 瀣 鳕 霪 瀛 瀠 藻

20画 五行属水的字是：齙 鰏 躄 鯿 辮 穮 繽 鬓 襮 瀿 瀵 酆 鰒 灌 蠔
鶘 護 驊 獾 鹹 瀾 瀲 瀧 鬕 顢 鶥 獼 蠛 魔 譬 蠙 瀼 攘 嚷 饗 響 瀷
瀹 灂
21画 五行属水的字是：黯 霸 贔 辯 驃 飆 飈 灃 灏 鶴 轟 歡 露 霹 鼙
颦 禳 灄 攜 纈 醺

22画 五行属水的字是：鷩 鰾 鱉 霽 霾 鰻 蘼 鰵 耱 轡 穰 瓤 灑 灘 鱈

23画 五行属水的字是：變 髕 鱝 鬟 黴 鱘

24画 五行属水的字是：灞 鬢 灝 襻 躞

25画 五行属水的字是：蠻 灣 戅

26画 五行属水的字是：灤

29画 五行属水的字是：鬱

30画 五行属水的字是：驫

31画 五行属水的字是：灩
'''