s = '''

五行属土的字：800个

1画 五行属土的字是： 一 乙

2画 五行属土的字是： 又

3画 五行属土的字是： 个 己 山 土 丸 卫 兀 丫 也 亿 尢 于

4画 五行属土的字是： 厄 切 瓦 王 韦 为 卬 夭 以 忆 尹 引 尤 友 与
予 曰允

5画 五行属土的字是： 艾 凹 鸟 圣 戊 阢 央 叶 永 用 由 右 幼 邘 孕
仔

6画 五行属土的字是： 吖 安 充 地 圪 艮 圭 灰 圾 岌 圹 讴 圮 屺 似
戍 吐 圩 伟 圬 邬 伍 仵 戌 压 伢 亚 讶 延 闫 羊 阳 爷 伊 衣 圯 夷
屹 亦 异 因 阴 优 有 迂 纡 屿 宇 羽 约 圳

7画 五行属土的字是： 阿 芺 岙 岜 坝 坂 坌 辰 肚 坊 坟 附 岗 坏 矶
均 坎 坑 块 岚 坜 牡 呕 怄 妑 圻 岐 岍 岖 坍 坛 秃 完 违 围 帏 闱
纬 位 呜 迕 庑 怃 忤 坞 氙 岘 轩 岈 迓 呀 冶 邺 医 诒 矣 抑 呓 邑
佚 役 吲 饮 迎 应 佣 甬 攸 忧 邮 犹 卣 佑 玙 欤 余 园 员 远 狁 运
址 坠

8画 五行属土的字是： 肮 垇 坳 坢 衩 诞 坻 坫 岽 矾 废 坩 矸 岣 岵
画 话 岬 坷 岢 矿 岿 坤 垃 岭 垅 垄 垆 峁 岷 坶 坭 拗 瓯 欧 殴 爬
帕 怕 坯 坪 坡 坦 坨 宛 往 旺 玮 委 瓮 岫 盱 诩 押 岩 奄 怏 肴 耶
夜 依 祎 饴 怡 迤 峄 佾 怿 诣 茔 拥 咏 呦 侑 盂 臾 育 鸢 玥 昀 郓
征 肫

9画 五行属土的字是： 哀 按 袄 砭 垞 昶 砗 城 垫 垤 垌 峒 砘 垛 垩
垡 费 砜 垓 垢 闺 胡 砉 垲 砍 垦 垮 奎 垒 峦 娈 垴 鸥 趴 盆 砒 砌
牵 峤 窃 埏 垧 哇 娃 威 畏 胃 诬 屋 侮 误 峡 型 勋 峋 鸦 哑 垭 砑
娅 咽 恹 匽 砚 养 垚 姚 要 咿 咦 贻 姨 舣 音 姻 垠 俑 勇 幽 疣 羑
囿 宥 诱 舁 禹 垣 爰 院 郧 陨 恽 峥 砖 窀

10画 五行属土的字是：啊 埃 唉 挨 砹 爱 俺 胺 案 盎 敖 峬 埕 础 砥
峨 恶 恩 砝 砩 埂 埚 监 砬 崃 崂 砺 砾 埒 砻 埋 袅 砰 破 埔 峭 容
砷 砣 诿 娓 軎 翁 唔 捂 娴 顼 埙 鸭 琊 蚜 氩 胭 盐 艳 晏 宴 氧 恙
眙 胰 酏 益 氤 殷 狺 蚓 狳 馀 谀 彧 眢 鸳 冤 袁 圆 阅 晕 砸 砟 砧
轾 准

11画 五行属土的字是：捱 庵 谙 埯 唵 崩 埠 埭 硐 堆 堕 硌 崮 惯 硅
崞 黄 基 崨 崛 崆 堀 逵 壸 硭 埝 啪 盘 培 堋 埤 畦 崎 堑 硗 埽 硕
眭 堂 窕 眺 堍 婉 唯 帷 惟 维 谓 尉 釫 牾 硒 硖 崤 硎 勖 崖 痖 焉
崦 阉 偃 痒 掖 揶 野 猗 移 痍 埸 逸 翌 寅 隐 婴 庸 恿 悠 蚰 蚴 隅
域 欲 跃 殒 酝 崭 埴

12画 五行属土的字是：隘 啽 媕 揞 晻 媪 奡 傲 奥 堡 堛 嵖 堾 堤 奠
堞 黑 堠 硷 堪 喹 塄 嵝 嵋 嵚 确 嵘 蛙 崴 琬 琟 嵬 猥 喂 猬 温 握
硪 痦 婺 骛 翕 遐 翔 硝 揠 腌 蜒 堰 崵 崾 腋 揖 壹 堙 喑 愔 瑛 鱿
釉 喁 嵛 琙 鼋 援 缘 越 粤 愠 崽 跖 蛭 嵫

13画 五行属土的字是：矮 碍 嗳 嗌 嫒 鹌 腤 暗 嶅 遨 嗷 廒 骜 塝 碑
碚 碜 碘 碉 碇 碓 痱 觟 嵴 跬 碌 硼 碰 嵊 嵩 塑 碎 塌 塘 填 碗 韪
艉 痿 嗡 蜈 鹉 瑕 睚 衙 鄢 颐 裔 意 鄞 雍 蛹 猷 瘀 瑀 誉 塬 猿 氲
韫 韵 稚

14画 五行属土的字是：瑷 璈 獒 碥 碴 墋 磁 磋 碲 碟 鲑 碱 碣 境 墚
墁 墙 墒 塾 墅 碳 鲔 稳 寤 鹜 墟 嘘 碹 嫣 旖 夤 撄 嘤 罂 缨 墉 慵
踊 辕 翟 嶂
15画 五行属土的字是：鞍 懊 磅 嶓 嶒 墀 嶝 墩 磙 嘿 蝴 糊 磕 蝰 磊
嶙 碾 豌 慰 鞋 糈 噎 靥 璎 影 蝣 牖 墺 豫 增 磔

16画 五行属土的字是：聱 螯 壁 衡 磺 磨 碛 融 歙 燕 噫 殪 瘾 鹦 壅
螈
17画 五行属土的字是：癌 闇 鮟 醠 謷 磴 礅 壕 壑 礁 嬲 嶷 翳 臆 膺
臃 黝 龠
18画 五行属土的字是：盫 鳌 蹦 璧 礓 礞 黟 彝 癔 鼬

19画 五行属土的字是：爊 礤 巅 疆 嬿 繶 鳙

20画 五行属土的字是：巉 壤 巍 鼯

21画 五行属土的字是：礴 蠡

22画 五行属土的字是：鹳 懿 饔

23画 五行属土的字是：罐
'''



# https://www.baidu.com/s?wd=%E4%BA%94%E8%A1%8C%E5%B1%9E%E9%87%91%E7%9A%84%E5%90%8D%E5%AD%97%E5%A5%B3%E5%AD%A9%E7%94%A8
# https://www.1212.com/qm/nvhai/5570.html
# https://baijiahao.baidu.com/s?id=1751609275250084857
# https://www.yw11.com/zidian/juhe/5-2-0-a/
# https://www.nanss.com/shenghuo/8650.html
ss = '''
牡羽婉怡鸥影圣岚容玉

悦宛纤安珵宇尹锻成韶数聪字姻姗春衫叶晨琳羲笑永玹秀诗如鑫旖姒青铭砂声辞瑞净然夕琮悦琦优忆珠
韵琌韦惠斯察识臣朝晨超省尊助粟千钟修趣施师珒珖依焉辛峙信责细早索谆询星壮正限仁庄存孜心鑫
谨恩亦思诗嫒秋忆镕悉艾歆喻帜珍仙阳亿静柔珠星瑶铭舒锦宠紫依童青姝倩姻庭慈纯初镁琪宣心融宥伊瑕韵

钰姝嫱倰汇琼惠珠丹彤冉妙纹姳姯园呤黛菊荣茗亭珆嫣媱珴妶丝馨瑾娣婉妮清莹婕丽仙璧冰桂倩敏维育湾芮草姐妩轩青荷娇静贞嫔媚娉奴含晴恬娅茜姬琴滟锳莓玫波竹棠胜瑶巧莎涟水淞芯霜舒珍佩晓媛彩东漩昭芃风娥怡婵枝梦薰馡霖彨冽林淑晶妍秀纯嵘珊漪怜琪雁瑗颖可美兰真盈偀萱花莉爱爽琬香岚妆越苹滢璇澜菀娜瀚娴蓓亿姗好音芊智琳姿藻燕韵姹姲嫦霞蔓纨悦璐枫莲瑜

以尉甬峦土夷础玮融亚优奥砚医于宴碟殷地予填忆园怿燕玙屾伊监娃缨徵岫曰往堇伢因奡砾瑛岑阿砖墙嵘域缘佾帏嵋垣瑷碎爱叶艳迎要岭容堰壁畏戊瓦娅幼尹袁娓完崔唯於允砺婉傲羊娈啊由黑境瓯嫣宛堪韦王峙嵬恩诞阅峥画礁影嫒亦坎瑕辰堆韫峡场韵颐依田岁衣咏璎异祎羽崎堡垂鸳戍与懿堤闫塔膺攸确岚型欲峪墨屿嬿彧鸟鸥琬悠圆怡音巍峭丫娴越旖惟垠戌又佚逸

怡宥恩婉唯岚允羽依伍央尹安圻宛岐允攸碟怡
'''

def check():
    print('len(ss)', len(ss))
    l = []
    print('Warning not availble:')
    for c in ss:
        if (c == ' '): continue
        if (c == '\r'): continue
        if (c == '\n'): print('')
        if c in l: continue
        if not c in s:
            print(c, end='')
            continue
        l.append(c)
    print('')
    print('len(l)', len(l))

    for i in l: print(i, end='')

sss = '牡羽婉怡鸥影圣岚容宛安宇尹字姻叶永旖优忆韵韦依焉恩亦嫒艾阳亿融宥伊瑕园嫣璧维育轩娅嵘爱琬越娴音燕以尉甬峦土夷础玮亚奥砚医于宴碟殷地予填怿玙监娃缨岫曰往伢因奡砾瑛阿砖墙域缘佾帏嵋垣瑷碎艳迎要岭堰壁畏戊瓦幼袁娓完唯允砺傲羊娈啊由黑境瓯堪王嵬诞阅峥画礁坎辰堆韫峡颐衣咏璎异祎崎堡鸳戍与懿堤闫膺攸确型欲屿嬿彧鸟悠圆巍峭丫惟垠戌又佚逸伍央圻岐'
sss = '牡羽婉怡鸥影圣岚容宛安宇尹字姻叶永旖优忆韵韦依焉恩亦嫒艾阳亿融宥伊瑕园嫣璧维育轩娅嵘爱琬越娴音燕以尉甬峦础玮亚奥砚医于宴碟殷予填怿玙娃缨岫往因砾瑛阿域缘帏嵋垣瑷艳迎要岭堰幼娓唯允傲由境阅峥画辰韫峡颐衣咏璎异祎崎鸳与懿堤膺攸确欲屿嬿彧鸟悠圆丫惟垠又佚逸央圻岐'
print('len(sss):',len(sss))
d = {}
from pypinyin import pinyin
for c in sss:
    p = pinyin(c)[0][0]
    print(c, p)
    if p in d:
        d[p].append(c)
    else:
        d[p] = [c]

def alias(k):
    k_alias = k
    k_alias = k_alias.replace('ā','a').replace('á','a').replace('ǎ','a').replace('à','a')
    k_alias = k_alias.replace('ē','e').replace('é','e').replace('ě','e').replace('è','e')
    k_alias = k_alias.replace('ī','i').replace('í','i').replace('ǐ','i').replace('ì','i')
    k_alias = k_alias.replace('ō','o').replace('ó','o').replace('ǒ','o').replace('ò','o')
    k_alias = k_alias.replace('ū','u').replace('ú','u').replace('ǔ','u').replace('ù','u')
    return k_alias

k_l = sorted(d.keys())
print('k_l:', k_l)
k_alias_l = [alias(k) for k in k_l]
used_k_alias = []

last_k_alias = ''
for i in range(len(k_l)):
    k = k_l[i]
    k_alias = k_alias_l[i]
    if (k_alias in used_k_alias): continue

    print('[', end='')
    for j in range(len(k_l)):
        if k_alias_l[j] == k_alias:
            print('"' + k_l[j] + '",', end='')
            for v in d[k_l[j]]:
                print('"' + v + '",', end='')
    print('],')
    used_k_alias.append(k_alias)